Revit 2024 API
ScheduleVerticalAlignment Enumeration
 Vertical alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum ScheduleVerticalAlignment
Visual Basic
Public Enumeration ScheduleVerticalAlignment
Visual C++
public enum class ScheduleVerticalAlignment
Members
Member name | Description
Top |  Top aligned
Middle |  Middle aligned
Bottom |  Bottom aligned
See Also
Autodesk.Revit.DB Namespace